Autodesk.Revit.DB.Analysis.GenericZone.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Analysis.GenericZoneDomainData,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Creates a new instance of a generic zone and adds it to the document.
doc:
The document where the element will be created and added.
name:
The name of the generic zone to be created.
domainData:
The specific domain requirements for the generic zone.
levelId:
The base level on which the generic zone will be created.
curveLoops:
The loops that define the lines, curves and areas that overlap or crosses the elements you want to belong to the zone.
Multiple loops are allowed, they can be open or closed, but they should be on the same horizontal plane.
Returns:
The newly created generic zone.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
The ElementId levelId is not a Level.
-or-
The curve loops in the input array are empty.
-or-
The input curve loops do not all lie in the same horizontal plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2020.1